# CurtainWallPanelHostId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurtainWallPanelHostId Property
ParameterTypeId Class See Also
---
"Host Id"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurtainWallPanelHostId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtainWallPanelHostId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurtainWallPanelHostId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace